
&НаСервереБезКонтекста
Процедура УстановитьЗначениеКонстантыНаСервере(АдресЭлектроннойПочты)
	
	Константы.АдресЭлектроннойПочты.Установить(АдресЭлектроннойПочты);
	
КонецПроцедуры

&НаКлиенте
Процедура кнГотово(Команда)
	
	Если кб99_РаботаСЭлектроннойПочтой.ПроверитьАдресЭлектроннойПочты(АдресЭлектроннойПочты) Тогда
		УстановитьЗначениеКонстантыНаСервере(АдресЭлектроннойПочты);
		кб99_РаботаСЭлектроннойПочтой.ОформитьПодписку(АдресЭлектроннойПочты);
	    ЭтаФорма.Закрыть();	
	Иначе
		кб99_Общие.СообщитьИнфо("Введите корректный адрес электронной почты");
	КонецЕсли;
	
КонецПроцедуры
