
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КоличествоФоновыхЗаданий = 0;
	ОбновитьОтображениеНадписиКоличествоАктивныхЗаданий();
	
КонецПроцедуры

&НаКлиенте
Процедура Нанесение(Команда)
	ОткрытьФорму("Документ.кб99_НанесениеКМ.ФормаСписка");	
КонецПроцедуры

&НаКлиенте
Процедура Отгрузка(Команда)
	ОткрытьФорму("Документ.кб99_Отгрузка.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ВводВОборот(Команда)
	ОткрытьФорму("Документ.кб99_ВводВОборот.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Агрегирование(Команда)
	ОткрытьФорму("Документ.кб99_Агрегация.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеТоваров(Команда)
	//ОткрытьФорму("Документ.кб99_ЗаказКМ.ФормаСписка");
	ОткрытьФорму("Справочник.кб99_Продукция.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКМ(Команда)
	ОткрытьФорму("Документ.кб99_ЗаказКМ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Параметры(Команда)
	
	ПараметрыТекущегоПользователя = кб99_Общие.НайтиПараметры();
	
	ОткрытьФорму("Справочник.кб99_Параметры.Форма.ФормаЭлемента", Новый Структура("Ключ", ПараметрыТекущегоПользователя));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "НовоеФоновоеЗадание" Тогда
		Если СписокФоновыхЗаданий.Количество() > 0 Тогда
			СписокФоновыхЗаданий.Добавить(Параметр, Источник);
			КоличествоФоновыхЗаданий = СписокФоновыхЗаданий.Количество();
			ОбновитьОтображениеНадписиКоличествоАктивныхЗаданий();
		Иначе
			СписокФоновыхЗаданий.Добавить(Параметр, Источник);
			КоличествоФоновыхЗаданий = СписокФоновыхЗаданий.Количество();
			ОбновитьОтображениеНадписиКоличествоАктивныхЗаданий();
			ПодключитьОбработчикОжидания("ПроверитьВыполнениеФоновыхЗаданий", 1, Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыполнениеФоновыхЗаданий()
	
	Если СписокФоновыхЗаданий.Количество() > 0 Тогда
		
		Для Каждого Задание Из СписокФоновыхЗаданий Цикл
			РезультатЗадания = ЗаданиеВыполнено(Задание.Значение);
			Если РезультатЗадания.Выполнено Тогда
				
				кб99_Общие.СообщитьИнфо(СтрШаблон("Задание [%1] выполнено %2", Задание.Представление, ?(РезультатЗадания.Успешно, "успешно", "с ошибками")));
				Если ЗначениеЗаполнено(РезультатЗадания.СообщенияПользователю) Тогда
					ОткрытьФорму("ОбщаяФорма.ФормаВыводаСообщенийПользователю", РезультатЗадания,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
				КонецЕсли;

				СписокФоновыхЗаданий.Удалить(СписокФоновыхЗаданий.Индекс(Задание));
				КоличествоФоновыхЗаданий = СписокФоновыхЗаданий.Количество();
				ОбновитьОтображениеНадписиКоличествоАктивныхЗаданий();

			КонецЕсли;	
		КонецЦикла;
		
	Иначе
		ОтключитьОбработчикОжидания("ПроверитьВыполнениеФоновыхЗаданий");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаданиеВыполнено(ИдентификаторЗадания) 
	
	Результат = Новый Структура;
	Успешно = Ложь;

	ФонЗад = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	
	Если ФонЗад.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
		МассивСообщений = ФонЗад.ПолучитьСообщенияПользователю();
		Результат.Вставить("СообщенияПользователю", МассивСообщений);
		Выполнено = Истина;
		Успешно = Истина;
	ИначеЕсли ФонЗад.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Выполнено = Ложь;
	ИначеЕсли ФонЗад.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		МассивСообщений = Новый Массив(ФонЗад.ПолучитьСообщенияПользователю());
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ФонЗад.ИнформацияОбОшибке.Описание;
		МассивСообщений.Добавить(Сообщение);
		Результат.Вставить("СообщенияПользователю", МассивСообщений);
		Выполнено = Истина;
	КонецЕсли;
	Результат.Вставить("Выполнено", Выполнено);
	Результат.Вставить("Успешно",   Успешно);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОтображениеНадписиКоличествоАктивныхЗаданий()
	
	Если КоличествоФоновыхЗаданий = 0 Тогда
		
		Элементы.НадписьКоличествоАктивныхЗаданий.Заголовок = "Нет активных операций";
		
	Иначе
		
		Элементы.НадписьКоличествоАктивныхЗаданий.Заголовок = "Количество активных операций:";                       
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЭлемента(Элемент, Параметры) Экспорт
 
	ЭтаФорма.ОбновитьОтображениеДанных();
 
КонецПроцедуры

&НаКлиенте
Процедура НадписьКоличествоАктивныхЗаданийНажатие(Элемент)
	
	Если СписокФоновыхЗаданий.Количество() > 0 Тогда
		ОповещениеПослеВыбораЭлемента = Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтотОбъект);
	    СписокФоновыхЗаданий.ПоказатьВыборЭлемента(ОповещениеПослеВыбораЭлемента, "Список активных операций");
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводИзОборота(Команда)
	ОткрытьФорму("Документ.кб99_ВыводИзОборотаОСУ.ФормаСписка");
КонецПроцедуры
