
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для а=0 По Параметры.СообщенияПользователю.Количество()-1 Цикл
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить(СтрШаблон("Сообщение_%1", а), Тип("ДекорацияФормы"));
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Истина;
		//НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
		НовыйЭлемент.Заголовок = Параметры.СообщенияПользователю[а].Текст;
		Если СтрНайти(ВРег(НовыйЭлемент.Заголовок), "ОШИБКА") <> 0 Тогда
			НовыйЭлемент.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры