
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если кб99_Общие.ПроверитьЗаполнениеДокумента(ПараметрКоманды) Тогда
		Если Найти(ПараметрыВыполненияКоманды.Источник.ИмяФормы,"Списка") = 0 Тогда
			ПараметрыВыполненияКоманды.Источник.этаФорма.Закрыть();
		КонецЕсли;
				
		АдресРезультатаФоновогоЗадания = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор); 
		
		ДлительнаяОперация = НачатьОтправкуДокументаВФоне(ПараметрКоманды, АдресРезультатаФоновогоЗадания);
		
		Оповестить("НовоеФоновоеЗадание", ДлительнаяОперация.ИдентификаторЗадания, "Отправка документа: "+ПараметрКоманды);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НачатьОтправкуДокументаВФоне(Док, АдресРезультатаФоновогоЗадания)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Неопределено);
	ПараметрыВыполнения.АдресРезультата = АдресРезультатаФоновогоЗадания; // всегда используем одно и то же временное хранилище
	ПараметрыПроцедуры = Док;
	Возврат ДлительныеОперации.ВыполнитьВФоне("кб99_crpt.ОтправитьДокумент_ТАПИ", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции