//&НаКлиенте
//Процедура ОбновитьКМ()
//	//ЭтаФорма.дсКМ.Отбор.Элементы.Очистить();
//	//ЭлементОтбора = ЭтаФорма.дсКМ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Регистратор");
//	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
//	//ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; // Опционально
//	//ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
//КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗапросы()
	ЭтаФорма.дсЗапросы.Отбор.Элементы.Очистить();
	ЭлементОтбора = ЭтаФорма.дсЗапросы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; // Опционально
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНадписи(ЭтаФорма);
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.OrderID = "";
		Объект.СтатусДокумента = Неопределено;
		Объект.СтатусЗапроса = Неопределено;
		Объект.Ошибки = "";
	КонецЕсли;
	
	//ОбновитьКМ();
	ОбновитьЗапросы();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	//Если Элемент.ТекущиеДанные = Неопределено Тогда
	//	ЭтаФорма.Элементы.КодыМаркировки.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСтрокиТовар", "");
	//Иначе
	//	ЭтаФорма.Элементы.КодыМаркировки.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСтрокиТовар",Элемент.ТекущиеДанные.КлючСтроки);
	//КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекДанные.КлючСтроки) Тогда
		ТекДанные.КлючСтроки = Новый УникальныйИдентификатор;
		//ЭтаФорма.Элементы.КодыМаркировки.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСтрокиТовар", ТекДанные.КлючСтроки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЭтаФорма.Элементы.Товары.ТекущаяСтрока = Неопределено Тогда
		Отказ = true;
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Элемент.ТекущиеДанные.КлючСтрокиТовар = ЭтаФорма.Элементы.Товары.ТекущиеДанные.КлючСтроки;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	тд = Элемент.Родитель.ТекущиеДанные;
	тд.Сумма = тд.Количество * тд.Цена;
	тд.Налог = тд.Сумма * 0.2;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	тд = Элемент.Родитель.ТекущиеДанные;
	тд.Сумма = тд.Количество * тд.Цена;
	тд.Налог = тд.Сумма * 0.2;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНадписи(Форма)
	
	Объект = Форма.Объект;
	
	//Запрос = кб99_Общие.НайтиПоследнийЗапрос( Объект.Ссылка );
	//Форма.OrderID = Запрос.OrderID;
	//Форма.СтатусЗапроса = Запрос.СтатусЗапроса;
	//
	//Если ЗначениеЗаполнено( Запрос.Ошибки ) Тогда
	//	Форма.Элементы.Ошибки.Видимость = Истина;
	//	Форма.Ошибки = Запрос.Ошибки;
	//Иначе
	//	Форма.Элементы.Ошибки.Видимость = Ложь;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено( Объект.Ошибки ) Тогда
		Форма.Элементы.Ошибки.Видимость = Истина;
		//Форма.Ошибки = Объект.Ошибки;
	Иначе
		Форма.Элементы.Ошибки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиКМОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Объект.КодыМаркировки.НайтиСтроки(Новый Структура("КМ", ВыбранноеЗначение)).Количество() = 0 Тогда
		нСтр = Элемент.Родитель.ТекущиеДанные;
		нСтр.КМ = ВыбранноеЗначение;
	Иначе
		ТекстСообщения = "Уже выбран код маркировки: "+ВыбранноеЗначение;
		кб99_Общие.СообщитьИнфо(ТекстСообщения);	
	КонецЕсли;

КонецПроцедуры
