&НаСервере
Процедура ПолучитьОтвет( ДокСсылка )
	
	СтрокаСодержимое = кб99_crpt.ПолучитьСодержимоеДокумента( ДокСсылка );
	
	Попытка		
		ДокJSON = кб99_crpt.jsonПрочитать( СтрокаСодержимое );
		
		
		////ДокОбъект.OrderID = СтруктураОтвет.Получить("reportId");
		//ДокОбъект.СтатусДокумента = Перечисления.кб99_СтатусДокумента[ ДокJSON["status"] ];
		//ДокОбъект.Записать();			
		Если ДокСсылка.СтатусДокумента = Перечисления.кб99_СтатусДокумента.CHECKED_OK ИЛИ 
			ДокСсылка.СтатусДокумента = Перечисления.кб99_СтатусДокумента.ACCEPTED ИЛИ 
			ДокСсылка.СтатусДокумента = Перечисления.кб99_СтатусДокумента.WAIT_ACCEPTANCE Тогда 
			ДокОбъект = ДокСсылка.ПолучитьОбъект();
			ДокОбъект.Записать( РежимЗаписиДокумента.Проведение );
		КонецЕсли;
		
	Исключение
	    Инфо = ИнформацияОбОшибке();
	    Сообщить("Описание='" + Инфо.Описание + "' ИмяМодуля='" + Инфо.ИмяМодуля + "' НомерСтроки=" + Инфо.НомерСтроки+" ИсходнаяСтрока='" + Инфо.ИсходнаяСтрока + "'");
		Сообщить( ОписаниеОшибки() );
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПолучитьОтвет( ПараметрКоманды );
	
КонецПроцедуры
