
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Запрос = кб99_Общие.НайтиПоследнийЗапрос( Ссылка );
	////СтатусЗапроса = Запрос.СтатусЗапроса;
	//
	//Движения.кб99_КодыМаркировки.Записывать = Истина;
	//Для Каждого ТекСтрокаКодыМаркировки Из КодыМаркировки Цикл
	//	Движение = Движения.кб99_КодыМаркировки.Добавить();
	//	Движение.Период = Дата;
	//	Движение.КМ = ТекСтрокаКодыМаркировки.КМ;
	//	Движение.Владелец = Организация;
	//	Движение.СтатусКМ = Перечисления.кб99_СтатусКМ.INTRODUCED;
	//	Движение.OrderID = Запрос.OrderID;
	//	
	//	СпрКм = ТекСтрокаКодыМаркировки.КМ.ПолучитьОбъект();
	//	СпрКм.ОргВладелец = Организация;
	//	СпрКм.СтатусКМ =  Перечисления.кб99_СтатусКМ.INTRODUCED;
	//	СпрКм.Записать();
	//КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если (ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг")) Тогда  
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Организация = ДокументОснование.Организация;
		
		Запрос = Новый Запрос();
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	РеализацияТоваровУслугТовары.Номенклатура КАК Товар,
		//               |	СУММА(РеализацияТоваровУслугТовары.СД_КоличествоКМ) КАК Количество,
		//               |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		//               |	РеализацияТоваровУслугТовары.Цена КАК Цена,
		//               |	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
		//               |	РеализацияТоваровУслугТовары.Количество КАК Вес
		//               |ИЗ
		//               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		//               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		//               |		ПО РеализацияТоваровУслугТовары.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
		//               |ГДЕ
		//               |	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
		//               |	И РеализацияТоваровУслугТовары.СД_КоличествоКМ > 0
		//               |
		//               |СГРУППИРОВАТЬ ПО
		//               |	РеализацияТоваровУслугТовары.Номенклатура,
		//               |	ШтрихкодыНоменклатуры.Штрихкод,
		//               |	РеализацияТоваровУслугТовары.Цена,
		//               |	РеализацияТоваровУслугТовары.Сумма,
		//               |	РеализацияТоваровУслугТовары.Количество";   

		Запрос.Текст = "ВЫБРАТЬ
		               |	РеализацияТоваровУслугТовары.Номенклатура КАК Товар,
		               |	СУММА(РеализацияТоваровУслугТовары.СД_КоличествоКМ) КАК Количество,
		               |	МАКСИМУМ(РеализацияТоваровУслугТовары.Цена) КАК Цена,
		               |	МАКСИМУМ(РеализацияТоваровУслугТовары.Сумма) КАК Сумма,
		               |	РеализацияТоваровУслугТовары.Номенклатура.СД_ШтрихКод КАК ШтрихКод,
		               |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Вес
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		               |ГДЕ
		               |	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
		               |	И РеализацияТоваровУслугТовары.СД_КоличествоКМ > 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслугТовары.Номенклатура,
		               |	РеализацияТоваровУслугТовары.Номенклатура.СД_ШтрихКод";  
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);		
		ВыборкаПоНоменклатуре = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
		ПричинаВыбытия = Перечисления.кб99_ПричиныВыбытия.OWN_USE; 
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		ВидПервичногоДокумента = Перечисления.кб99_ВидыПервичныхДокументовИСМП.OTHER;
		НаименованиеПервичногоДокумента = "УПД";
		НомерПервичногоДокумента = ДанныеЗаполнения.Номер;
		ДатаПервичногоДокумента = ДанныеЗаполнения.Дата;
		
		Пока ВыборкаПоНоменклатуре.Следующий() Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНоменклатуре);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры