
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если кб99_Общие.ПроверитьЗаполнениеДокумента(ПараметрКоманды) Тогда
		Если Найти(ПараметрыВыполненияКоманды.Источник.ИмяФормы,"Списка") = 0 Тогда
			ПараметрыВыполненияКоманды.Источник.этаФорма.Закрыть();
		КонецЕсли;
		
		Док = ПараметрКоманды;
		Запрос = кб99_crpt.ПодготовитьЗапрос( Док );
				
		//ПараметрыОрганизации = кб99_Общие.НайтиПараметры();
		ПараметрыОрганизации = кб99_Общие.НайтиПараметрыНаСервере( Док );
		
		sThumbprint = ПараметрыОрганизации["Отпечаток"]; 
		sKeySigned = кб99_crpt_НаКлиенте.SignText( Запрос["product_document"], sThumbprint, Истина);     
		Запрос.Вставить("signature", sKeySigned);
		
		АдресРезультатаФоновогоЗадания = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор); 
		
		ПараметрыДокумента = Новый Соответствие;
		ПараметрыДокумента.Вставить("Документ", Док);
		ПараметрыДокумента.Вставить("Параметры", ПараметрыОрганизации);
		ПараметрыДокумента.Вставить("Запрос", Запрос);
		
		ДлительнаяОперация = НачатьОтправкуДокументаВФоне( ПараметрыДокумента, АдресРезультатаФоновогоЗадания);
		
		Оповестить("ФоновоеЗаданиеВыводОСУ", ДлительнаяОперация.ИдентификаторЗадания, "Отправка документа: "+ПараметрКоманды);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НачатьОтправкуДокументаВФоне(ПараметрыПроцедуры, АдресРезультатаФоновогоЗадания)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Неопределено);
	ПараметрыВыполнения.АдресРезультата = АдресРезультатаФоновогоЗадания; // всегда используем одно и то же временное хранилище
	//ПараметрыПроцедуры = Док;
	Возврат ДлительныеОперации.ВыполнитьВФоне("кб99_crpt.ОтправитьДокумент_ТруАПИ_НаСервере", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции